nichiyama/vasp_calc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<title>格子欠陥について最近の研究から</title>
<!-- 2018-07-27 金 12:13 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="関西学院大学・理工学部・情報科学科　西谷滋人 2017" />
<link rel="stylesheet" type="text/css" href="/Users/nitch65/Github/grad_research_2018/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/Users/nitch65/Github/grad_research_2018/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/default.min.css"></head>
<body>
<div id="content">
<h1 class="title">格子欠陥について最近の研究から</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. VASPの計算手順</a>
<ul>
<li><a href="#sec-1-1">1.1. modeling, 計算モデルの作成</a></li>
<li><a href="#sec-1-2">1.2. calc, vaspへの計算投入</a>
<ul>
<li><a href="#sec-1-2-1">転送</a></li>
<li><a href="#sec-1-2-2">asura0での作業</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. analysis, 解析</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> VASPの計算手順</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> modeling, 計算モデルの作成</h3>
<div class="outline-text-3" id="text-1-1">
<p>
/Users/bob/materials_science/boundary/modeling
において
</p>
<pre class="example">
modeler make 2 2 2 0
</pre>
<p>
で
</p>
<pre class="example">
-rw-r--r--@  1 bob  staff  119887  7 27 10:57 view.svg
-rw-r--r--   1 bob  staff    3754  7 27 10:57 POSCAR_0_2220
-rw-r--r--   1 bob  staff     216  7 27 10:57 modeler_2220
</pre>
<p>
を作成．
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> calc, vaspへの計算投入</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">転送</h4>
<div class="outline-text-4" id="text-1-2-1">
<pre class="example">
&gt; scp POSCAR_0_2220 mini:~/
POSCAR_0_2220          100% 3754   193.3KB/s   00:00    
&gt; ssh min
Last login: Thu Jul 26 10:04:01 2018 from 219.115.158.116
[macmini:~] bob% scp POSCAR_0_2220 asura0:~/
POSCAR_0_2220          100% 3754   336.7KB/s   00:00    
[macmini:~] bob% ssh asura0
Last login: Thu Jul 26 10:46:09 2018 from mini
loading .bash_profile
[bob@asura0 ~]$ ls
0_1110  0s_fix        90_2213_36   90_4417_188  FixINCAR.txt      submit_code
0_2220  2015_calc     90_2213_40   90_4440_512  old_files         tmp.tgz
0_3330  90_10519_636  90_2220_64   90_5519_168  perfect_slab      vasp_potentials
0_4440  90_1110_8     90_3315_96   90_5519_636  POSCAR_0_2220     vasp_res
0s      90_2213_32    90_3330_216  Cu           POSCAR_90_1110_8  vasprun
</pre>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">asura0での作業</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
まず必要なdirectoryを作成．
</p>
<pre class="example">
 999  mkdir 0_2220_tmp
1000  mv POSCAR_0_2220 0_2220_tmp
1001  cd 0_2220_tmp
1005  cp ../0_2220/KPOINTS .
1005  cp ../0_2220/POTCAR .
1007  cp POSCAR_0_2220 POSCAR
</pre>

<pre class="example">
vs -i
</pre>
<p>
でinner_relax dirを作って，そこに必要なファイルをcp.
</p>
<pre class="example">
&gt; ls
INCAR  KPOINTS  POSCAR  POTCAR  Rakefile
</pre>

<p>
これ以降は，新たに入れたRakefileを使って作業．
</p>
<pre class="example">
&gt; rake 
rake clean            # clean up vasp files except continuous calc
rake cubic            # submit cubic relax on vasp after dir preparation
rake fix              # fix run from dir_names with INCAR.fix
rake fix2             # fix2 run from file under 1st with INCAR.fix
rake gets             # gets the results from DIR
rake gets_newest      # gets_newest Rakefile from templates
rake puts_newest      # puts newest Rakefile to vasprun
rake resubmit_asura6  # resubmit_asura6 QUEUE_NO
rake submit           # submit vasp after dir preparation add suffix with 1 or 1m etc
rake submit2          # submit2 vasp with whole_range, add suffix with 1 or 1m etc
</pre>

<pre class="example">
rake submit
</pre>
<p>
で，VASPの計算をqueueにsubmit. queueについては，Sun Grid Engineを参照．
</p>
<pre class="example">
ls -1
INCAR
inner_relax_0_0
inner_relax_0_1
inner_relax_0_-1
inner_relax_-1_0
inner_relax_-1_1
inner_relax_-1_-1
inner_relax_-2_0
inner_relax_-2_1
inner_relax_-2_-1
KPOINTS
POSCAR
POTCAR
Rakefile
</pre>
<p>
inner_relaxに外部のdimensionを変えた量を付け足したdirectoryが
自動生成されて，その内部の計算データをもとにqueueへsubmit.
</p>

<p>
queueの様子は
</p>
<pre class="example">
vs -j 
</pre>
<p>
で見ることができる．-jはjobの略．
</p>

<pre class="example">
all.q@asura6                   BIP   0/16/20        4.74     linux-x64     
   5661 0.55500 inner_rela bob          r     07/27/2018 11:27:16     8        
   5662 0.55500 inner_rela bob          r     07/27/2018 11:27:19     8        
---------------------------------------------------------------------------------
all.q@asura7                   BIP   0/16/24        7.14     linux-x64     
   5663 0.55500 inner_rela bob          r     07/27/2018 11:27:19     8        
   5664 0.55500 inner_rela bob          r     07/27/2018 11:27:22     8        
---------------------------------------------------------------------------------
all.q@asura8                   BIP   0/8/8          2.46     linux-x64     
   5660 0.55500 inner_rela bob          r     07/27/2018 11:27:16     8
</pre>

<p>
計算結果は，
</p>
<pre class="example">
1038  cd inner_relax_-2_1
1041  cat inner_relax_-2_1.o5666
</pre>
<p>
で参照．
</p>
</div>
</div>
</div>


<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> analysis, 解析</h3>
<div class="outline-text-3" id="text-1-3">
<pre class="example">
1047  mkdir finished
1048  mv inner_relax_* finished/
1050  rake gets finished
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 関西学院大学・理工学部・情報科学科　西谷滋人 2017</p>
<p class="date">Created: 2018-07-27 金 12:13</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
